#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
int main()
{
	int arr[5][5] = { (1, 3, 5), (1, 5, 4), (5, 2, 9), (1, 5, 3, 1), (8, 4, 4, 7),(5,9,4) };//‘，’表达式为最右边的值
	int arr1[4][4] = { {1,2,3,4},{5,6,7,8},{5,10,11,12},{13,14,15,16} };
	int(*parr)[3];
	parr=arr1;
	printf("%d\n", parr[2][2] - arr1[2][2]);//不同类型的数组可以赋值给数组指针，运用比较灵活
	printf("%d\n", &parr[2][2] - &arr1[2][2]);//地址的减运算的是他们之间相对的距离
////////////////////////////////////////////////////////////////////////
	int a[4] = { 1, 2, 3, 4 };
	int *ptr1 = (int*)(&a + 1);//取a数组的地址，到跳过整个该数组的地址
	int *ptr2 = (int*)((int)a + 1);//将a首元素中地址转为整形+1以后再转换为地址
	printf("%x\n%x", ptr1[-1], *ptr2);//ptr1末尾地址-1  指向a中最后一个元素
	//ptr2    小端存储   数组为01 00 00 00 02 00 00 00 03 00 00 00 04 00 00 00
	//             原本指向这里↑ ↑现在指向第二字节   往后面再数3字节  得到 00 00 00 02   输出为  02 00 00 00 
	return 0;
}